http/results/httpun-retro20k-classic-libev-r1.txt
Running 16s test @ http://127.0.0.1:19409/
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.866ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.900ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.845ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.843ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.70ms    1.44ms  20.72ms   90.35%
    Req/Sec     5.28k   834.55    10.78k    78.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.42ms
 75.000%    2.06ms
 90.000%    2.83ms
 99.000%    8.22ms
 99.900%   12.90ms
 99.990%   16.28ms
 99.999%   20.08ms
100.000%   20.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.045     0.000000            1         1.00
       0.499     0.100000        11778         1.11
       0.739     0.200000        23533         1.25
       0.964     0.300000        35271         1.43
       1.188     0.400000        47025         1.67
       1.419     0.500000        58777         2.00
       1.540     0.550000        64671         2.22
       1.658     0.600000        70525         2.50
       1.779     0.650000        76375         2.86
       1.914     0.700000        82279         3.33
       2.061     0.750000        88173         4.00
       2.141     0.775000        91082         4.44
       2.235     0.800000        94015         5.00
       2.341     0.825000        96946         5.71
       2.467     0.850000        99887         6.67
       2.619     0.875000       102822         8.00
       2.713     0.887500       104306         8.89
       2.831     0.900000       105758        10.00
       2.977     0.912500       107227        11.43
       3.161     0.925000       108696        13.33
       3.465     0.937500       110164        16.00
       3.693     0.943750       110893        17.78
       3.993     0.950000       111628        20.00
       4.399     0.956250       112366        22.86
       4.859     0.962500       113096        26.67
       5.371     0.968750       113830        32.00
       5.651     0.971875       114197        35.56
       5.955     0.975000       114563        40.00
       6.231     0.978125       114932        45.71
       6.571     0.981250       115298        53.33
       7.011     0.984375       115666        64.00
       7.299     0.985938       115853        71.11
       7.583     0.987500       116033        80.00
       8.015     0.989062       116218        91.43
       8.391     0.990625       116404       106.67
       8.775     0.992188       116585       128.00
       9.015     0.992969       116675       142.22
       9.279     0.993750       116768       160.00
       9.663     0.994531       116864       182.86
       9.991     0.995313       116956       213.33
      10.415     0.996094       117042       256.00
      10.639     0.996484       117088       284.44
      10.887     0.996875       117133       320.00
      11.127     0.997266       117179       365.71
      11.519     0.997656       117228       426.67
      11.895     0.998047       117273       512.00
      11.975     0.998242       117295       568.89
      12.111     0.998437       117317       640.00
      12.271     0.998633       117340       731.43
      12.631     0.998828       117363       853.33
      12.967     0.999023       117386      1024.00
      13.207     0.999121       117397      1137.78
      13.495     0.999219       117409      1280.00
      13.655     0.999316       117420      1462.86
      13.831     0.999414       117433      1706.67
      13.991     0.999512       117443      2048.00
      14.183     0.999561       117449      2275.56
      14.319     0.999609       117455      2560.00
      14.423     0.999658       117460      2925.71
      14.655     0.999707       117466      3413.33
      14.799     0.999756       117472      4096.00
      14.887     0.999780       117475      4551.11
      15.095     0.999805       117479      5120.00
      15.167     0.999829       117480      5851.43
      15.367     0.999854       117483      6826.67
      16.079     0.999878       117486      8192.00
      16.279     0.999890       117488      9102.22
      16.463     0.999902       117489     10240.00
      16.671     0.999915       117490     11702.86
      16.783     0.999927       117492     13653.33
      16.815     0.999939       117493     16384.00
      17.727     0.999945       117494     18204.44
      18.079     0.999951       117495     20480.00
      18.079     0.999957       117495     23405.71
      18.543     0.999963       117496     27306.67
      19.071     0.999969       117497     32768.00
      19.071     0.999973       117497     36408.89
      19.759     0.999976       117498     40960.00
      19.759     0.999979       117498     46811.43
      19.759     0.999982       117498     54613.33
      20.079     0.999985       117499     65536.00
      20.079     0.999986       117499     72817.78
      20.079     0.999988       117499     81920.00
      20.079     0.999989       117499     93622.86
      20.079     0.999991       117499    109226.67
      20.735     0.999992       117500    131072.00
      20.735     1.000000       117500          inf
#[Mean    =        1.698, StdDeviation   =        1.444]
#[Max     =       20.720, Total count    =       117500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  318805 requests in 16.00s, 636.65MB read
Requests/sec:  19924.20
Transfer/sec:     39.79MB

JSON Output:
{
	"requests": 318805,
	"duration_in_microseconds": 16000892.00,
	"bytes": 667577670,
	"requests_per_sec": 19924.20,
	"bytes_transfer_per_sec": 41721278.41,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1419
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 2061
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 2831
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 8215
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 12895
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 16279
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 20079
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 20735
		}
	]
}