http/results/httpun-retro20k-effects-uring-r1.txt
Running 16s test @ http://127.0.0.1:19407/
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.857ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.783ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.897ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.869ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.86ms    1.94ms  16.69ms   90.15%
    Req/Sec     5.27k     0.99k   11.22k    78.19%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.35ms
 75.000%    1.90ms
 90.000%    3.76ms
 99.000%   10.37ms
 99.900%   15.29ms
 99.990%   16.46ms
 99.999%   16.70ms
100.000%   16.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.060     0.000000            1         1.00
       0.524     0.100000        11760         1.11
       0.740     0.200000        23508         1.25
       0.949     0.300000        35265         1.43
       1.156     0.400000        47030         1.67
       1.352     0.500000        58790         2.00
       1.445     0.550000        64626         2.22
       1.540     0.600000        70509         2.50
       1.637     0.650000        76361         2.86
       1.753     0.700000        82252         3.33
       1.905     0.750000        88094         4.00
       2.010     0.775000        91035         4.44
       2.155     0.800000        93987         5.00
       2.369     0.825000        96910         5.71
       2.663     0.850000        99834         6.67
       3.111     0.875000       102775         8.00
       3.391     0.887500       104242         8.89
       3.755     0.900000       105711        10.00
       4.203     0.912500       107176        11.43
       4.723     0.925000       108656        13.33
       5.339     0.937500       110117        16.00
       5.739     0.943750       110849        17.78
       6.075     0.950000       111579        20.00
       6.419     0.956250       112318        22.86
       6.815     0.962500       113050        26.67
       7.295     0.968750       113783        32.00
       7.559     0.971875       114151        35.56
       7.827     0.975000       114516        40.00
       8.159     0.978125       114884        45.71
       8.615     0.981250       115251        53.33
       9.143     0.984375       115621        64.00
       9.391     0.985938       115805        71.11
       9.679     0.987500       115984        80.00
      10.023     0.989062       116167        91.43
      10.519     0.990625       116350       106.67
      11.087     0.992188       116533       128.00
      11.407     0.992969       116628       142.22
      11.679     0.993750       116717       160.00
      11.999     0.994531       116809       182.86
      12.511     0.995313       116900       213.33
      13.015     0.996094       116992       256.00
      13.383     0.996484       117039       284.44
      13.775     0.996875       117083       320.00
      14.055     0.997266       117130       365.71
      14.375     0.997656       117175       426.67
      14.799     0.998047       117222       512.00
      14.943     0.998242       117244       568.89
      15.047     0.998437       117267       640.00
      15.143     0.998633       117291       731.43
      15.207     0.998828       117313       853.33
      15.311     0.999023       117336      1024.00
      15.399     0.999121       117348      1137.78
      15.535     0.999219       117360      1280.00
      15.671     0.999316       117370      1462.86
      15.871     0.999414       117382      1706.67
      15.967     0.999512       117394      2048.00
      16.015     0.999561       117399      2275.56
      16.095     0.999609       117405      2560.00
      16.143     0.999658       117410      2925.71
      16.199     0.999707       117416      3413.33
      16.239     0.999756       117423      4096.00
      16.247     0.999780       117425      4551.11
      16.287     0.999805       117428      5120.00
      16.311     0.999829       117431      5851.43
      16.327     0.999854       117433      6826.67
      16.447     0.999878       117436      8192.00
      16.463     0.999890       117438      9102.22
      16.479     0.999902       117439     10240.00
      16.511     0.999915       117440     11702.86
      16.543     0.999927       117442     13653.33
      16.559     0.999939       117443     16384.00
      16.575     0.999945       117444     18204.44
      16.623     0.999951       117446     20480.00
      16.623     0.999957       117446     23405.71
      16.623     0.999963       117446     27306.67
      16.687     0.999969       117448     32768.00
      16.687     0.999973       117448     36408.89
      16.687     0.999976       117448     40960.00
      16.687     0.999979       117448     46811.43
      16.687     0.999982       117448     54613.33
      16.703     0.999985       117450     65536.00
      16.703     1.000000       117450          inf
#[Mean    =        1.864, StdDeviation   =        1.937]
#[Max     =       16.688, Total count    =       117450]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  314060 requests in 16.00s, 627.18MB read
Requests/sec:  19627.95
Transfer/sec:     39.20MB

JSON Output:
{
	"requests": 314060,
	"duration_in_microseconds": 16000652.00,
	"bytes": 657641640,
	"requests_per_sec": 19627.95,
	"bytes_transfer_per_sec": 41100927.64,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1352
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 1905
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 3755
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 10367
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 15287
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 16463
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 16703
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 16703
		}
	]
}